In [1]:
import bs4
import requests
from bs4 import BeautifulSoup as soup
from urllib.request import urlopen
from urllib import request
import pandas as pd

#### Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.

In [2]:
link_url='https://en.wikipedia.org/wiki/Main_Page'
url=urlopen(link_url)
data=soup(url,'html.parser')
data.findAll('head')
for i in data.findAll('head'):
    print(i.title.text)

Wikipedia, the free encyclopedia

#### Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release) and save it in form of a CSV file.

In [3]:
page=requests.get('https://www.imdb.com/list/ls091520106/')
print(page)
data=soup(page.content,'html.parser')

<Response [200]>

In [4]:
with open('Top 100 Movies list.csv','w') as file:
    file.write("Movie Name,Release Year,Movie Rating,")
    file.write('\n')
    for i,j,k in zip(data.find_all('h3',class_='lister-item-header'),data.find_all('span',class_='lister-item-year text-muted unbold'),data.find_all('div',class_='ipl-rating-star small')):
        if len(i.a.text.split(','))>1:
            i=i.a.text.replace(',','')
        else:
            i=i.a.text     
        values=i,j.text.strip('()'),k.find('span',class_='ipl-rating-star__rating').text
        file.writelines("%s," % val for val in list(values))
        file.write('\n')
file.close()

In [5]:
pd.read_csv('/home/pavankumar/data_sci_dec/internship_projects/Top 100 Movies list.csv')

                  Movie Name Release Year  Movie Rating  Unnamed: 3
0   The Shawshank Redemption         1994           9.3         NaN
1              The Godfather         1972           9.2         NaN
2     The Godfather: Part II         1974           9.0         NaN
3            The Dark Knight         2008           9.0         NaN
4               12 Angry Men         1957           9.0         NaN
..                       ...          ...           ...         ...
95        North by Northwest         1959           8.3         NaN
96        A Clockwork Orange         1971           8.3         NaN
97                    Snatch         2000           8.3         NaN
98                    Amélie         2001           8.3         NaN
99                   The Kid         1921           8.3         NaN

[100 rows x 4 columns]

#### Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release) and save it in form of a CSV file.

In [6]:
page=requests.get('https://www.imdb.com/list/ls009997493/')
print(page)
data=soup(page.content,'html.parser')

<Response [200]>

In [7]:
with open('Top 100 Indian Movies list.csv','w') as file:
    file.write("Movie Name,Movie Rating,Release Year,")
    file.write('\n')
    for i,j,k in zip(data.find_all('h3',class_='lister-item-header'),data.find_all('div',class_='ipl-rating-star small'),data.find_all('span',class_='lister-item-year text-muted unbold')):
        if len(i.a.text.split(','))>1:
            i=i.a.text.replace(',','')
        else:
            i=i.a.text     
        values=i,j.find('span',class_='ipl-rating-star__rating').text,k.text.strip('()')
        file.writelines("%s," % val for val in list(values))
        file.write('\n')
file.close()

In [8]:
pd.read_csv('/home/pavankumar/data_sci_dec/internship_projects/Top 100 Indian Movies list.csv')

               Movie Name  Movie Rating Release Year  Unnamed: 3
0         Rang De Basanti           8.2         2006         NaN
1                3 Idiots           8.4         2009         NaN
2        Taare Zameen Par           8.4         2007         NaN
3          Dil Chahta Hai           8.1         2001         NaN
4   Swades: We the People           8.2         2004         NaN
..                    ...           ...          ...         ...
95            Wake Up Sid           7.6         2009         NaN
96               Rangeela           7.5         1995         NaN
97    Shatranj Ke Khilari           7.7         1977         NaN
98     Pyaar Ka Punchnama           7.7         2011         NaN
99          Ek Hasina Thi           7.5         2004         NaN

[100 rows x 4 columns]

#### Write a python program to scrap book name, author name, genre and book review of any 5 books from
‘www.bookpage.com’

In [9]:
page=requests.get('https://bookpage.com/reviews')
data=soup(page.content,'html.parser')

In [10]:

import csv 
# opening the csv file in 'w' mode 
file = open('Books names and author.csv', 'w', newline ='') 
with file: 
    # identifying header   
    header = ['Book name', 'Author', 'Gener','Review by','Review'] 
    writer = csv.DictWriter(file, fieldnames = header) 
    writer.writeheader() 
    page=requests.get('https://bookpage.com/reviews')
    data=soup(page.content,'html.parser')  
    # writing data row-wise into the csv file 
    for i in data.find_all('div',class_='flex-article-content'):
        page1=requests.get('https://bookpage.com/'+i.a.get('href'))
        data1=soup(page1.content,'html.parser')
        for j in data1.find_all('p',class_='sans bold author-info'):
            review_by=j.a.text.replace('\n','')
        for k in data1.find_all('p',class_='genre-links'):
            gener=k.text.replace('\n','')
        writer.writerow({'Book name' : i.a.text,  
                     'Author': i.p.text.replace("\n",''),  
                     'Gener': gener,
                     'Review by': review_by,
                        'Review':i.find('p',class_='excerpt').text})

In [11]:
pd.read_csv('/home/pavankumar/data_sci_dec/internship_projects/Books names and author.csv')

,Book name,Author,Gener,Review by,Review
0,The Ladies of the Secret Circus,Constance Sayers,Fiction / Speculative Fiction,Matthew Jackson,\nConstance Sayers’ second novel is just as mu...
1,The Unbroken,C.L. Clark,Science Fiction & Fantasy / Fantasy,Noah Fram,\nLieutenant Touraine is a conscript. Kidnappe...
2,New Yorkers,Craig Taylor,Nonfiction / Culture / History,Jessica Wakeman,"\nIn January 2014, Canadian writer Craig Taylo..."
3,★ Red Widow,Alma Katsu,Mystery & Suspense / Suspense,Elyse Discher,"\nAlma Katsu, known for her spooky historical ..."
4,★ Just as I Am,"Cicely Tyson, Robin Miles",Audio / Nonfiction / Biography & Memoir / Memoir,Deborah Mason,\nNarrator Robin Miles bringing the same warmt...
5,★ Red Island House,Andrea Lee,Fiction / Literary Fiction,Carole V. Bell,\nThe stories of Andrea Lee’s Red Island House...
6,★ Flight of the Diamond Smugglers,Matthew Gavin Frank,Nonfiction / Memoir / Animals,Linda M. Castellitto,\nMatthew Gavin Frank's Flight of the Diamond ...
7,The One Thing You'd Save,"Linda Sue Park, Robert Sae-Heng",Children's / Middle Grade,Autumn Allen,"\nIn The One Thing You’d Save, a teacher named..."
8,The Daughters of Kobani,Gayle Tzemach Lemmon,Nonfiction / History / Middle Eastern History,Priscilla Kipp,\nThe story of how young Kurdish women brought...
9,The Zoologist's Guide to the Galaxy,Arik Kershenbaum,Nonfiction / Science & Nature,Becky Libourel Diamond,\nZoologist Arik Kershenbaum draws on a range ...

#### Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:
i. Top 10 ODI teams in men’s cricket along with the records for matches, points and rating. 
ii. Top 10 ODI Batsmen in men along with the records of their team and rating. 
iii. Top 10 ODI bowlers along with the records of their team and rating.

In [12]:
page=requests.get('https://www.icc-cricket.com/rankings/mens/team-rankings/odi')
data=soup(page.content,'html.parser')

In [13]:
import csv
cr_table = data.find("table", attrs={"class": "table"})
with open("Top 20 Men's Cricket teams.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    write.writerow(['Pos','Team','Team Short name','Matches','Points','Rating']) 
    for i in cr_table.tbody.find_all("tr"):
        write.writerow([j.replace(' ','') for j in i.text.split('\n') if j.strip(' ')])
f.close()

In [14]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 20 Men's Cricket teams.csv")

    Pos            Team Team Short name  Matches Points  Rating
0     1         England             ENG       44  5,405     123
1     2           India             IND       52  6,102     117
2     3      NewZealand              NZ       33  3,857     117
3     4       Australia             AUS       39  4,344     111
4     5     SouthAfrica              SA       31  3,345     108
5     6        Pakistan             PAK       35  3,490     100
6     7      Bangladesh             BAN       38  3,432      90
7     8        SriLanka              SL       42  3,372      80
8     9      WestIndies              WI       49  3,802      78
9    10     Afghanistan             AFG       31  1,844      59
10   11         Ireland             IRE       29  1,316      45
11   12     Netherlands             NED        5    222      44
12   13        Zimbabwe             ZIM       27  1,121      42
13   14            Oman             OMA       12    479      40
14   15        Scotland             SCO       16    419      26
15   16             UAE             UAE       17    360      21
16   17           Nepal             NEP        9    161      18
17   18         Namibia             NAM        9    152      17
18   19    UnitedStates             USA       14    185      13
19   20  PapuaNewGuinea             PNG       14      0       0

In [15]:
page=requests.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi')
data=soup(page.content,'html.parser')

In [16]:
import csv
cr_table = data.find("table", attrs={"class": "table"})
with open("Top 10 Men's ODI Batting Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    write.writerow(cr_table.thead.tr.text.replace('\n',' ').split())
    f_row=[i.strip(' \n') for i in data.find("a", attrs={"class": "rankings-block__banner-link"}).text.split('\n\n\n') if i]
    f_row.append(data.find("div", attrs={"class": "rankings-block__banner--rating"}).text)
    write.writerow(f_row)
    for i in cr_table.tbody.find_all("tr"):
        write.writerow([j.replace(' ','') for j in i.text.split('\n') if j.strip(' ')])
f.close()

In [17]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Men's ODI Batting Rankings.csv")

  Pos             Player Team  Rating
0   1        Virat Kohli  IND     870
1   2        RohitSharma  IND     842
2   3          BabarAzam  PAK     837
3   4         RossTaylor   NZ     818
4   5         AaronFinch  AUS     791
5   6  FrancoisduPlessis   SA     790
6   7        DavidWarner  AUS     773
7               ShaiHope   WI     773
8   9     KaneWilliamson   NZ     765
9  10      QuintondeKock   SA     755

In [18]:
import csv
lis1=[]
lis2=[]
final_lis=[]
with open("Top 10 Men's ODI Batting Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    for i,j in zip(data.find_all("table", attrs={"class":"table"}),data.find_all("div", attrs={"class": "col-4 col-12-desk touch-scroll-list__element"})):
        lis1.append(i.find_all("tr"))
        lis2.append(j.find_all('a'))
    for k in lis1[0]:
        final_lis.append([j.replace(' ','') for j in k.text.split('\n') if j.strip(' ') and len(j)<50])
    for l in lis2[0]:
        a=[j.replace(' ','') for j in l.text.split('\n') if j.strip(' ') and len(j)<50]
        a.append(data.find_all("div", attrs={"class": "rankings-block__banner--rating"})[1].text)
        final_lis.insert(1,a)
    write.writerows(final_lis)
f.close()

In [19]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Men's ODI Batting Rankings.csv")

  Pos             Player Team  Rating
0   1         ViratKohli  IND     722
1   2        RohitSharma  IND     842
2   3          BabarAzam  PAK     837
3   4         RossTaylor   NZ     818
4   5         AaronFinch  AUS     791
5   6  FrancoisduPlessis   SA     790
6   7        DavidWarner  AUS     773
7               ShaiHope   WI     773
8   9     KaneWilliamson   NZ     765
9  10      QuintondeKock   SA     755

In [20]:
import csv
lis1=[]
lis2=[]
final_lis=[]
with open("Top 10 Men's ODI Bowling Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    for i,j in zip(data.find_all("table", attrs={"class":"table"}),data.find_all("div", attrs={"class": "col-4 col-12-desk touch-scroll-list__element"})):
        lis1.append(i.find_all("tr"))
        lis2.append(j.find_all('a'))
    for k in lis1[1]:
        final_lis.append([j.replace(' ','') for j in k.text.split('\n') if j.strip(' ') and len(j)<50])
    for l in lis2[1]:
        a=[j.replace(' ','') for j in l.text.split('\n') if j.strip(' ') and len(j)<50]
        a.append(data.find_all("div", attrs={"class": "rankings-block__banner--rating"})[1].text)
        final_lis.insert(1,a)
    write.writerows(final_lis)
f.close()

In [21]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Men's ODI Bowling Rankings.csv")

   Pos            Player Team  Rating
0    1        TrentBoult   NZ     722
1    2    MujeebUrRahman  AFG     708
2    3     JaspritBumrah  IND     700
3    4       MehediHasan  BAN     694
4    5       ChrisWoakes  ENG     675
5    6      KagisoRabada   SA     665
6    7     JoshHazlewood  AUS     660
7    8  MustafizurRahman  BAN     658
8    9      MohammadAmir  PAK     647
9   10        PatCummins  AUS     646

In [22]:
import csv
lis1=[]
lis2=[]
final_lis=[]
with open("Top 10 Men's ODI All-Rounder Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    for i,j in zip(data.find_all("table", attrs={"class":"table"}),data.find_all("div", attrs={"class": "col-4 col-12-desk touch-scroll-list__element"})):
        lis1.append(i.find_all("tr"))
        lis2.append(j.find_all('a'))
    for k in lis1[2]:
        final_lis.append([j.replace(' ','') for j in k.text.split('\n') if j.strip(' ') and len(j)<50])
    for l in lis2[2]:
        a=[j.replace(' ','') for j in l.text.split('\n') if j.strip(' ') and len(j)<50]
        a.append(data.find_all("div", attrs={"class": "rankings-block__banner--rating"})[1].text)
        final_lis.insert(1,a)
    write.writerows(final_lis)
f.close()

In [23]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Men's ODI All-Rounder Rankings.csv")

   Pos             Player Team  Rating
0    1      ShakibAlHasan  BAN     722
1    2       MohammadNabi  AFG     294
2    3        ChrisWoakes  ENG     281
3    4          BenStokes  ENG     276
4    5          ImadWasim  PAK     271
5    6         RashidKhan  AFG     270
6    7  ColindeGrandhomme   NZ     265
7    8     RavindraJadeja  IND     253
8    9    MitchellSantner   NZ     251
9   10       SeanWilliams  ZIM     238

### Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:
i) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.
ii) Top 10 women’s ODI players along with the records of their team and rating.
iii) Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [24]:
page=requests.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')
data=soup(page.content,'html.parser')

In [25]:
import csv
cr_table = data.find("table", attrs={"class": "table"})
with open("Top 20 Women's ODI Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    write.writerow(['Pos','Team','Team Short name','Matches','Points','Rating']) 
    for i in cr_table.tbody.find_all("tr"):
        write.writerow([j.replace(' ','') for j in i.text.split('\n') if j.strip(' ')])
f.close()

In [26]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 20 Women's ODI Rankings.csv")

   Pos         Team Team Short name  Matches Points  Rating
0    1    Australia             AUS       15  2,436     162
1    2  SouthAfrica              SA       24  2,828     118
2    3      England             ENG       17  1,993     117
3    4        India             IND       20  2,226     111
4    5   NewZealand              NZ       18  1,696      94
5    6   WestIndies              WI       12  1,025      85
6    7     Pakistan             PAK       15  1,101      73
7    8   Bangladesh             BAN        5    306      61
8    9     SriLanka              SL       11    519      47
9   10      Ireland             IRE        2     25      13

In [27]:
page=requests.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi')
data=soup(page.content,'html.parser')

In [28]:
import csv
lis1=[]
lis2=[]
final_lis=[]
with open("Top 10 Women's ODI Batting Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    for i,j in zip(data.find_all("table", attrs={"class":"table"}),data.find_all("div", attrs={"class": "col-4 col-12-desk uniform-grid__section touch-scroll-list__element"})):
        lis1.append(i.find_all("tr"))
        lis2.append(j.find_all('a'))
    for k in lis1[0]:
        final_lis.append([j.replace(' ','') for j in k.text.split('\n') if j.strip(' ') and len(j)<50])
    for l in lis2[0]:
        a=[j.replace(' ','') for j in l.text.split('\n') if j.strip(' ') and len(j)<50]
        a.append(data.find_all("div", attrs={"class": "rankings-block__banner--rating"})[1].text)
        final_lis.insert(1,a)
    write.writerows(final_lis)
f.close()

In [29]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Women's ODI Batting Rankings.csv")

   Pos            Player Team  Rating
0    1     TammyBeaumont  ENG     804
1    2        LizelleLee   SA     758
2    3        MegLanning  AUS     749
3    4    StafanieTaylor   WI     746
4    5       AlyssaHealy  AUS     741
5    6  AmySatterthwaite   NZ     740
6    7    SmritiMandhana  IND     710
7    8        MithaliRaj  IND     709
8    9       EllysePerry  AUS     691
9   10     NatalieSciver  ENG     685

In [30]:
import csv
lis1=[]
lis2=[]
final_lis=[]
with open("Top 10 Women's ODI Bowling Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    for i,j in zip(data.find_all("table", attrs={"class":"table"}),data.find_all("div", attrs={"class": "col-4 col-12-desk uniform-grid__section touch-scroll-list__element"})):
        lis1.append(i.find_all("tr"))
        lis2.append(j.find_all('a'))
    for k in lis1[1]:
        final_lis.append([j.replace(' ','') for j in k.text.split('\n') if j.strip(' ') and len(j)<50])
    for l in lis2[1]:
        a=[j.replace(' ','') for j in l.text.split('\n') if j.strip(' ') and len(j)<50]
        a.append(data.find_all("div", attrs={"class": "rankings-block__banner--rating"})[1].text)
        final_lis.insert(1,a)
    write.writerows(final_lis)
f.close()

In [31]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Women's ODI Bowling Rankings.csv")

   Pos          Player Team  Rating
0    1    JessJonassen  AUS     804
1    2   MarizanneKapp   SA     747
2    3     MeganSchutt  AUS     735
3    4   ShabnimIsmail   SA     717
4    5   JhulanGoswami  IND     681
5    6     EllysePerry  AUS     666
6    7  KatherineBrunt  ENG     655
7    8     PoonamYadav  IND     641
8    9   AyabongaKhaka   SA     638
9   10      AmeliaKerr   NZ     619

In [32]:
import csv
lis1=[]
lis2=[]
final_lis=[]
with open("Top 10 Women's ODI All-Rounder Rankings.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    for i,j in zip(data.find_all("table", attrs={"class":"table"}),data.find_all("div", attrs={"class": "col-4 col-12-desk uniform-grid__section touch-scroll-list__element"})):
        lis1.append(i.find_all("tr"))
        lis2.append(j.find_all('a'))
    for k in lis1[2]:
        final_lis.append([j.replace(' ','') for j in k.text.split('\n') if j.strip(' ') and len(j)<50])
    for l in lis2[2]:
        a=[j.replace(' ','') for j in l.text.split('\n') if j.strip(' ') and len(j)<50]
        a.append(data.find_all("div", attrs={"class": "rankings-block__banner--rating"})[1].text)
        final_lis.insert(1,a)
    write.writerows(final_lis)
f.close()

In [33]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Top 10 Women's ODI All-Rounder Rankings.csv")

   Pos           Player Team  Rating
0    1      EllysePerry  AUS     804
1    2    MarizanneKapp   SA     418
2    3   StafanieTaylor   WI     410
3    4    NatalieSciver  ENG     349
4    5     DeeptiSharma  IND     343
5    6     JessJonassen  AUS     301
6    7     SophieDevine   NZ     274
7    8   DanevanNiekerk   SA     243
8    9   KatherineBrunt  ENG     236
9   10  AshleighGardner  AUS     223

### Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [46]:
page=requests.get('https://www.amazon.in/s?k=mobile+under+20000&i=electronics&ref=nb_sb_noss_1')
data=soup(page.content,'html.parser')
page

In [51]:

import csv
with open("Mobile phones under Rs. 20,000.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    write.writerow(['Product Name','Rating','Price','Image Sourse'])
    for i in data.find_all('div',class_='sg-col-inner'):
        try:
            for k,l,m in zip(i.find_all('div',class_='a-row a-size-small'),i.find_all('span',class_='a-price-whole'),i.find_all('img',class_='s-image')):
                vals=i.div.h2.a.span.text,k.span.span.a.i.text,l.text,m['src']
                write.writerow(list(vals))
        except:
            pass

In [53]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Mobile phones under Rs. 20,000.csv")

,Product Name,Rating,Price,Image Sourse
0,"Redmi 9A (Nature Green, 2GB Ram, 32GB Storage)...",4.2 out of 5 stars,"6,799",https://m.media-amazon.com/images/I/71sxlhYhKW...
1,"Redmi 9 (Sky Blue, 4GB RAM, 64GB Storage)",4.1 out of 5 stars,"8,799",https://m.media-amazon.com/images/I/71A9Vo1Bat...
2,"Oppo A31 (Mystery Black, 6GB RAM, 128GB Storag...",4.1 out of 5 stars,"11,990",https://m.media-amazon.com/images/I/71KCwNV6Mu...
3,"Redmi 9A (Nature Green, 3GB Ram, 32GB Storage)...",4.2 out of 5 stars,"7,499",https://m.media-amazon.com/images/I/71sxlhYhKW...
4,"Redmi 9 Prime (Space Blue, 4GB RAM, 64GB Stora...",4.2 out of 5 stars,"9,499",https://m.media-amazon.com/images/I/71U2SiHgbi...
5,"Redmi Note 9 Pro Max (Interstellar Black, 6GB ...",4.2 out of 5 stars,"14,999",https://m.media-amazon.com/images/I/71usqWEJle...
6,"Redmi Note 9 (Pebble Grey, 4GB RAM 64GB Storag...",4.2 out of 5 stars,"10,999",https://m.media-amazon.com/images/I/71X5I1cVfb...
7,"Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB...",4.2 out of 5 stars,"16,499",https://m.media-amazon.com/images/I/71-Su4Wr0H...
8,"Samsung Galaxy M31s (Mirage Blue, 6GB RAM, 128...",4.3 out of 5 stars,"18,499",https://m.media-amazon.com/images/I/61d-phh4Gf...
9,"Oppo A31 (Fantasy White, 6GB RAM, 128GB Storag...",4.1 out of 5 stars,"11,990",https://m.media-amazon.com/images/I/61IhTtJUXJ...
10,"Redmi 9 Prime (Sunrise Flare, 4GB RAM, 64GB St...",4.2 out of 5 stars,"9,499",https://m.media-amazon.com/images/I/71U2SiHgbi...
11,"Samsung Galaxy M01 Core (Black, 2GB RAM, 32GB ...",3.5 out of 5 stars,"6,199",https://m.media-amazon.com/images/I/71AYb2AGHX...
12,"Redmi 9A (Midnight Black, 2GB RAM, 32GB Storag...",4.2 out of 5 stars,"6,799",https://m.media-amazon.com/images/I/71sxlhYhKW...
13,"Samsung Galaxy M12 (Blue,4GB RAM, 64GB Storage...",3.5 out of 5 stars,"10,999",https://m.media-amazon.com/images/I/71yYaNztZ0...
14,"Samsung Galaxy M12 (Blue,6GB RAM, 128GB Storag...",3.5 out of 5 stars,"13,499",https://m.media-amazon.com/images/I/71yYaNztZ0...
15,"Redmi 9 Prime (Matte Black, 4GB RAM, 64GB Stor...",4.2 out of 5 stars,"9,499",https://m.media-amazon.com/images/I/71U2SiHgbi...
16,"Vivo Y91i (Ocean Blue, 2GB RAM, 32GB Storage) ...",4.1 out of 5 stars,"7,990",https://m.media-amazon.com/images/I/51FnmxwFHD...
17,"OPPO A31 (Mystery Black, 4GB RAM, 64GB Storage...",4.1 out of 5 stars,"9,990",https://m.media-amazon.com/images/I/71KCwNV6Mu...
18,"Samsung Galaxy M31s (Mirage Black, 6GB RAM, 12...",4.3 out of 5 stars,"18,499",https://m.media-amazon.com/images/I/71BFG8Zu7z...
19,"Samsung Galaxy M12 (White,4GB RAM, 64GB Storag...",3.5 out of 5 stars,"10,999",https://m.media-amazon.com/images/I/71PVpFc7Fw...
20,"Samsung Galaxy M12 (Black,6GB RAM, 128GB Stora...",3.5 out of 5 stars,"13,499",https://m.media-amazon.com/images/I/714QWDxXgN...
21,"OPPO A31 (Lake Green, 4GB RAM, 64GB Storage) w...",4.1 out of 5 stars,"9,990",https://m.media-amazon.com/images/I/71AHtKejSl...
22,"Samsung Galaxy M12 (Black,4GB RAM, 64GB Storag...",3.5 out of 5 stars,"10,999",https://m.media-amazon.com/images/I/714QWDxXgN...

#### Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.

In [38]:
page=requests.get('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YFXe9FkzZuT')
data=soup(page.content,'html.parser')
page

In [39]:
import csv
with open("Extended Forecast for San Francisco.csv", 'w') as f: 
    # using csv.writer method from CSV package 
    write = csv.writer(f) 
    write.writerow(['Period','Short Description','Temperature','Description'])
    for i,j in zip(data.find_all('li',class_='forecast-tombstone'),data.find_all('div',class_='col-sm-10 forecast-text')):
        try:
            vals=i.div.find_all('p')[0].text,i.div.find_all('p')[2].text,i.div.find_all('p')[3].text,j.text
            write.writerow(list(vals))
        except:
            pass

In [40]:
pd.read_csv("/home/pavankumar/data_sci_dec/internship_projects/Extended Forecast for San Francisco.csv")

,Period,Short Description,Temperature,Description
0,Today,Sunny,High: 68 °F,"Sunny, with a high near 68. North wind 15 to 2..."
1,Tonight,Clear,Low: 50 °F,"Clear, with a low around 50. North wind 10 to ..."
2,Wednesday,Sunny,High: 68 °F,"Sunny, with a high near 68. North wind 6 to 11..."
3,WednesdayNight,Partly Cloudy,Low: 48 °F,"Partly cloudy, with a low around 48. West wind..."
4,Thursday,Mostly Sunny,High: 63 °F,"Mostly sunny, with a high near 63. West northw..."
5,ThursdayNight,Mostly Clear,Low: 46 °F,"Mostly clear, with a low around 46."
6,Friday,Sunny,High: 70 °F,"Sunny, with a high near 70."
7,FridayNight,Clear,Low: 48 °F,"Clear, with a low around 48."
8,Saturday,Sunny,High: 74 °F,"Sunny, with a high near 74."

#### Write a python program to scrape ‘software developer’ job listings from ‘Monster.com’. It should include all the jobs listed for the next 5 pages.

In [41]:
page=requests.get('https://www.monsterindia.com/')
data=soup(page.content,'html.parser')
page

In [42]:
data

<html><head>
<title>Access Denied</title>
</head><body>
<h1>Access Denied</h1>

You don't have permission to access "http://www.monsterindia.com/" on this server.<p>
Reference #18.945dd217.1616497788.25c6e4b8
</p></body>
</html>